fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_НачисленияСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаНачисления</name>
    <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type><types>String</types><stringQualifiers/></type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_НачисленияСотрудников/ВКМ_НачисленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_НачисленияСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_СуммаНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидНачисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <registerType>Balances</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <periodicity>Month</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	Если НЕ ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// ВКМ_Изменение_Начало
	Если НЕ ЗначениеЗаполнено(ВКМ_СуммаНачисления) Или ВКМ_СуммаНачисления <= 0 Тогда
		ВКМ_СуммаНачисления = ВКМ_РассчитатьСуммуНачисленияПоУсловиямОплаты(ВКМ_Сотрудник, Дата);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВКМ_СуммаНачисления) Или ВКМ_СуммаНачисления <= 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма начисления должна быть больше нуля.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// ВКМ_Изменение_Конец

	НДФЛ = ВКМ_ОбслуживаниеКлиентов.ВКМ_РассчитатьНДФЛ(ВКМ_СуммаНачисления);
	СуммаКВыплате = ВКМ_СуммаНачисления - НДФЛ;

	Движения.ВКМ_НачисленияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	ДвижениеНачисление = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеНачисление.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНачисление.Период = Дата;
	ДвижениеНачисление.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеНачисление.ВКМ_ВидНачисления = НСтр("ru='Оклад'");
	ДвижениеНачисление.ВКМ_СуммаНачисления = ВКМ_СуммаНачисления;

	ДвижениеНДФЛ = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеНДФЛ.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНДФЛ.Период = Дата;
	ДвижениеНДФЛ.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеНДФЛ.ВКМ_ВидНачисления = НСтр("ru='НДФЛ'");
	ДвижениеНДФЛ.ВКМ_СуммаНачисления = НДФЛ;

	ДвижениеВзаиморасчетов = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	ДвижениеВзаиморасчетов.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеВзаиморасчетов.Период = Дата;
	ДвижениеВзаиморасчетов.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеВзаиморасчетов.ВКМ_Сумма = СуммаКВыплате;

КонецПроцедуры

Функция ВКМ_РассчитатьСуммуНачисленияПоУсловиямОплаты(Сотрудник, ДатаДокумента)

	ЗапросУсловияОплаты = Новый Запрос;
	ЗапросУсловияОплаты.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УсловияОплаты.ВКМ_Оклад КАК ВКМ_Оклад,
	|	УсловияОплаты.ВКМ_ПроцентОтРабот КАК ВКМ_ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК УсловияОплаты
	|ГДЕ
	|	УсловияОплаты.ВКМ_Сотрудник = &Сотрудник
	|	И УсловияОплаты.Период <= &ДатаДокумента
	|УПОРЯДОЧИТЬ ПО
	|	УсловияОплаты.Период УБЫВ";
	ЗапросУсловияОплаты.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросУсловияОплаты.УстановитьПараметр("ДатаДокумента", ДатаДокумента);

	ВыборкаУсловий = ЗапросУсловияОплаты.Выполнить().Выбрать();
	Если НЕ ВыборкаУсловий.Следующий() Тогда
		Возврат 0;
	КонецЕсли;

	НачалоПериодаМесяца = НачалоМесяца(ДатаДокумента);
	КонецПериодаМесяца = КонецМесяца(ДатаДокумента);

	ЗапросВыработки = Новый Запрос;
	ЗапросВыработки.Текст =
	"ВЫБРАТЬ
	|	СУММА(Выработка.ВКМ_СуммаКОплатеОборот) КАК ВКМ_СуммаПоРаботам
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ВКМ_Сотрудник = &Сотрудник) КАК Выработка";
	ЗапросВыработки.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросВыработки.УстановитьПараметр("НачалоПериода", НачалоПериодаМесяца);
	ЗапросВыработки.УстановитьПараметр("КонецПериода", КонецПериодаМесяца);

	ВыборкаВыработки = ЗапросВыработки.Выполнить().Выбрать();
	СуммаПоРаботам = 0;
	Если ВыборкаВыработки.Следующий() Тогда
		СуммаПоРаботам = ?(ЗначениеЗаполнено(ВыборкаВыработки.ВКМ_СуммаПоРаботам), ВыборкаВыработки.ВКМ_СуммаПоРаботам, 0);
	КонецЕсли;

	Возврат Окр(ВыборкаУсловий.ВКМ_Оклад + (СуммаПоРаботам * ВыборкаУсловий.ВКМ_ПроцентОтРабот / 100), 2);

КонецФункции

#КонецЕсли
